/* No comment provided by engineer. */
"%@ (%@) : Connection Notice" = "%1$@ (%2$@) : Yhteyshuomautus";

/* first %@ is an account name; second is a service. This is a title for a window */
"%@ (%@) Setup" = "%1$@ (%2$@) Setup";

/* No comment provided by engineer. */
"%@ has %u new messages." = "Tunnuksessa %1$@ on %2$u uutta viestiä.";

/* No comment provided by engineer. */
"%@ has 1 new message." = "%@ on yksi uusi viesti.";

/* No comment provided by engineer. */
"%@ is on your local contact list but not on the server list. Do you want to add this contact to your list?" = "%@ on paikallisessa ystäväluettelossa, muttei palvelimen luettelossa. Halouatko lisätä ystävän luetteloon?";

/* XMPP service discovery browser gateway tooltip */
"%@; double-click to register." = "%@; double-click to register.";

/* No comment provided by engineer. */
"(unknown)" = "(tuntematon)";

/* Placeholder displayed as the name of a new account */
"<New Account>" = "<Uusi tunnus>";

/* No comment provided by engineer. */
"Ad-Hoc command; double-click to execute" = "Ad-Hoc command; double-click to execute";

/* No comment provided by engineer. */
"Add" = "Lisää";

/* No comment provided by engineer. */
"Adium : Notice" = "Adium : Huomautus";

/* No comment provided by engineer. */
"Adium can't verify the identity of \"%@\"." = "Adium ei pysty varmentamaan käyttäjän \"%@\" henkilöllisyyttä.";

/* Message shown when a contact's profile can't be found */
"Adium could not find any information in the user's profile. This may not be a registered name." = "Adium ei kyennyt löytämään käyttäjän profiilia. Tämä nimi ei välttämättä ole rekisteriöty.";

/* No comment provided by engineer. */
"Adium is authorized for Facebook Chat." = "Adium is authorized for Facebook Chat.";

/* No comment provided by engineer. */
"Adium Notice: %@" = "Adiumin huomautus: %@";

/* No comment provided by engineer. */
"Adium User" = "Adium User";

/* Button title to allow an action */
"Allow" = "Salli";

/* No comment provided by engineer. */
"Allow MSN Mobile pages?" = "Salli MSN Mobile -sivut";

/* Action menu item for MSN accounts to toggle whether Mobile pages [forwarding messages to a mobile device] are enabled */
"Allow/Disallow Mobile Pages" = "Salli/Estä MSN Mobile -sivut";

/* No comment provided by engineer. */
"Always Appear Offline to %@" = "Näytä aina offline-tilassa olevalta ystävälle %@";

/* No comment provided by engineer. */
"An error was encountered sending the file." = "Tiedostoa lähettäessä tapahtui virhe";

/* No comment provided by engineer. */
"Appear Offline to %@" = "Näytä offline-tilassa olevalta henkilölle: %@";

/* No comment provided by engineer. */
"Appear Online to %@" = "Näytä online-tilassa olevalta henkilölle: %@";

/* No comment provided by engineer. */
"Authenticating" = "Varmistetaan";

/* Connection step */
"Balancer handshake" = "Balancer handshake";

/* No comment provided by engineer. */
"Ban" = "Ban";

/* No comment provided by engineer. */
"Bankick" = "Bankick";

/* No comment provided by engineer. */
"Blocked" = "Torjuttu";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cancel Presence Notification to %@" = "Cancel Presence Notification to %@";

/* Category table column header for the service discovery browser */
"Category" = "Kategoria";

/* No comment provided by engineer. */
"Change Currently Registered Email Address" = "Vaihda rekisteröityä sähköpostiosoitetta.";

/* Menu item title for changing the password of an account */
"Change Password" = "Vaihda salasana";

/* No comment provided by engineer. */
"Conference service; double-click to join" = "Conference service; double-click to join";

/* No comment provided by engineer. */
"Configure IM Forwarding" = "Pikaiviestien edelleenohjaus";

/* Button title to connect; this is a verb */
"Connect" = "Yhdistä";

/* Connection step */
"Connected" = "Yhdistetty";

/* No comment provided by engineer. */
"Connecting" = "Yhdistetään";

/* No comment provided by engineer. */
"Connection error." = "Yhteysvirhe";

/* No comment provided by engineer. */
"Connection established" = "Yhteys luotu";

/* No comment provided by engineer. */
"Contact list synchronization error for %@" = "Virhe sykronoitaessa ystäväluetteloa tunnuksessa: %@";

/* No comment provided by engineer. */
"Contacting authorization server" = "Contacting authorization server";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Could not complete authorization." = "Could not complete authorization.";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Delete & Unregister" = "Poista ja poista rekisteröinti";

/* No comment provided by engineer. */
"Delete Account" = "Poista tunnus";

/* No comment provided by engineer. */
"Delete Account from Server" = "Delete Account from Server";

/* No comment provided by engineer. */
"Delete the account %@? You can also optionally unregister the account on the server if possible." = "Delete the account %@? You can also optionally unregister the account on the server if possible.";

/* No comment provided by engineer. */
"Deop" = "Deop";

/* No comment provided by engineer. */
"Devoice" = "Devoice";

/* Direct IM is an AIM-specific phrase for transferring images in the message window */
"Direct IM connected" = "Direct IM connected";

/* Direct IM is an AIM-specific phrase for transferring images in the message window */
"Direct IM disconnected" = "Direct IM disconnected";

/* No comment provided by engineer. */
"Directory service; double-click to search" = "Directory service; double-click to search";

/* Button title to prevent an action */
"Disallow" = "Disallow";

/* No comment provided by engineer. */
"Discovery Browser" = "Discovery Browser";

/* No comment provided by engineer. */
"Display Currently Registered Email Address" = "Näytä käytettävä sähköpostiosoite";

/* No comment provided by engineer. */
"Do you want to allow or disallow people on your buddy list to send you MSN Mobile pages to your cell phone or other mobile device?" = "Do you want to allow or disallow people on your buddy list to send you MSN Mobile pages to your cell phone or other mobile device?";

/* No comment provided by engineer. */
"Don't Always Appear Offline to %@" = "Don't Always Appear Offline to %@";

/* Used as a label for a username specified by email address */
"Email" = "Email";

/* Connection step */
"Exchanging key hash" = "Exchanging key hash";

/* No comment provided by engineer. */
"Export Sametime List..." = "Export Sametime List...";

/* No comment provided by engineer. */
"Facebook Account Setup" = "Facebook Account Setup";

/* Label for the username for a Facebook contact */
"Facebook Email" = "Facebook Email";

/* No comment provided by engineer. */
"Facebook ID" = "Facebook ID";

/* No comment provided by engineer. */
"Fetching..." = "Fetching...";

/* No comment provided by engineer. */
"File Send Error" = "File Send Error";

/* No comment provided by engineer. */
"Finalizing connection" = "Finalizing connection";

/* No comment provided by engineer. */
"Forcing Login" = "Forcing Login";

/* Generic fields request window title */
"Form" = "Form";

/* No comment provided by engineer. */
"From: " = "From: ";

/* No comment provided by engineer. */
"Getting Cookie" = "Getting Cookie";

/* No comment provided by engineer. */
"GG Number" = "GG Number";

/* No comment provided by engineer. */
"GTalk ID" = "GTalk ID";

/* No comment provided by engineer. */
"Handshake Acknowledged; Sending Login" = "Handshake Acknowledged; Sending Login";

/* No comment provided by engineer. */
"Handshaking" = "Handshaking";

/* No comment provided by engineer. */
"ICQ Number" = "ICQ Number";

/* No comment provided by engineer. */
"Import Sametime List..." = "Import Sametime List...";

/* Error message displayed when the server reports username or password as being incorrect. */
"Incorrect username or password" = "Incorrect username or password";

/* No comment provided by engineer. */
"Info" = "Info";

/* No comment provided by engineer. */
"Initializing Stream" = "Initializing Stream";

/* No comment provided by engineer. */
"Initiate Conference with %@" = "Initiate Conference with %@";

/* No comment provided by engineer. */
"Initiate Direct IM with %@" = "Initiate Direct IM with %@";

/* No comment provided by engineer. */
"Initiate Multiuser Chat with %@" = "Initiate Multiuser Chat with %@";

/* No comment provided by engineer. */
"Invite" = "Invite";

/* No comment provided by engineer. */
"IRC (Internet Relay Chat)" = "IRC (Internet Relay Chat)";

/* No comment provided by engineer. */
"Jabber ID" = "Jabber ID";

/* JID (Jabber ID) table column header for the service discovery browser. This may not need to be localized. */
"JID" = "JID";

/* No comment provided by engineer. */
"Join" = "Join";

/* No comment provided by engineer. */
"Join %@'s Chat" = "Join %@'s Chat";

/* No comment provided by engineer. */
"Kick" = "Kick";

/* No comment provided by engineer. */
"Launch %@" = "Launch %@";

/* No comment provided by engineer. */
"LiveJournal ID" = "LiveJournal ID";

/* Connection step */
"Logging in" = "Logging in";

/* No comment provided by engineer. */
"Login Acknowledged" = "Login Acknowledged";

/* No comment provided by engineer. */
"Login Redirected" = "Login Redirected";

/* No comment provided by engineer. */
"Looking up server" = "Looking up server";

/* No comment provided by engineer. */
"Member Name" = "Member Name";

/* user mood tooltip title */
"Mood" = "Mood";

/* No comment provided by engineer. */
"MSN Passport" = "MSN Passport";

/* Name table column header for the service discovery browser */
"Name" = "Nimi";

/* No comment provided by engineer. */
"New Mail" = "Uusi sähköposti";

/* Sample name and server for new IRC accounts */
"nickname" = "nickname";

/* Name for IRC user names */
"Nickname" = "Nickname";

/* No comment provided by engineer. */
"No reason was given." = "Erityistä syytä ei annettu.";

/* No comment provided by engineer. */
"No server has been configured for the %@ account %@. Please enter one below to connect" = "No server has been configured for the %1$@ account %2$@. Please enter one below to connect";

/* No comment provided by engineer. */
"No Server Specified" = "No Server Specified";

/* No comment provided by engineer. */
"Node:" = "Node:";

/* No comment provided by engineer. */
"OK" = "Ok";

/* No comment provided by engineer. */
"Op" = "Op";

/* No comment provided by engineer. */
"Open Mail in Browser" = "Open Mail in Browser";

/* Name for the orphans group */
"Orphans" = "Orphans";

/* No comment provided by engineer. */
"Parse Error." = "Parse Error.";

/* No comment provided by engineer. */
"Password sent" = "Salasana lähetetty";

/* No comment provided by engineer. */
"Ping %@" = "Ping %@";

/* No comment provided by engineer. */
"Presence Settings for %@" = "Tila-asetukset henkilölle: %@";

/* No comment provided by engineer. */
"Promoting authorization for chat" = "Promoting authorization for chat";

/* No comment provided by engineer. */
"Re-request Authorization from %@" = "Pyydää udelleen lupaa henkilöltä: %@";

/* Connection step */
"Reading data" = "Luetaan dataa";

/* Connection step */
"Reading server key" = "Luetaan palvelimen avainta";

/* No comment provided by engineer. */
"Really remove gateway?" = "Really remove gateway?";

/* No comment provided by engineer. */
"Received authorization" = "Lupa myönnetty";

/* alert default button */
"Remove" = "Remove";

/* gateway menu item */
"Remove gateway" = "Remove gateway";

/* No comment provided by engineer. */
"Requesting authorization" = "Requesting authorization";

/* No comment provided by engineer. */
"Retrieving buddy list" = "Vastaanotetaan ystäväluetteloa";

/* Roster - the Jabber default group */
"Roster" = "Roster";

/* No comment provided by engineer. */
"Screen Name" = "Näyttönimi";

/* No comment provided by engineer. */
"Screen name sent" = "Näyttönimi lähetetty";

/* No comment provided by engineer. */
"Search for Contact By Email Address" = "Etsi yhteystietoa sähköpostiosoitteella";

/* No comment provided by engineer. */
"Search for Users" = "Search for Users";

/* No comment provided by engineer. */
"Search Results" = "Search Results";

/* No comment provided by engineer. */
"Send" = "Lähetä";

/* No comment provided by engineer. */
"Send Message" = "Send Message";

/* No comment provided by engineer. */
"Send to %@'s Mobile" = "Lähetä tekstiviestillä henkilölle: %@";

/* No comment provided by engineer. */
"Sending Cookie" = "Sending Cookie";

/* No comment provided by engineer. */
"Sending Handshake" = "Sending Handshake";

/* Window title for the service discovery browser */
"Service Discovery Browser" = "Service Discovery Browser";

/* No comment provided by engineer. */
"Service:" = "Service:";

/* No comment provided by engineer. */
"Set Home Phone Number" = "Aseta kotipuhelin";

/* No comment provided by engineer. */
"Set Mobile Phone Number" = "Aseta matkapuhelin";

/* No comment provided by engineer. */
"Set Mood" = "Set Mood";

/* No comment provided by engineer. */
"Set Nickname" = "Set Nickname";

/* No comment provided by engineer. */
"Set Privacy Options" = "Muuta yksityisyyden astuksia";

/* No comment provided by engineer. */
"Set User Info" = "Muuta omia tietoja";

/* No comment provided by engineer. */
"Set Work Phone Number" = "Aseta työpuhelin";

/* Title for the MSN display name setting dialogue box */
"Set your friendly name." = "Aseta näyttönimi";

/* Title for the dialogue prompting for your home phone number */
"Set your home phone number." = "Aseta oma kotipuhelin";

/* Title for the dialogue prompting for your mobile phone number */
"Set your mobile phone number." = "Aseta oma matkapuhelin";

/* Title for the dialogue prompting for your work phone number */
"Set your work phone number." = "Aseta oma työpuhelin";

/* Account action menu item to show a list of contacts for whom this account is awaiting authorization to be able to show them in the contact list */
"Show Contacts Awaiting Authorization" = "Näytä hyväksymistä odottavat ystävät";

/* No comment provided by engineer. */
"Show Server Certificate" = "Show Server Certificate";

/* No comment provided by engineer. */
"Starting authentication" = "Starting authentication";

/* No comment provided by engineer. */
"Starting Services" = "Starting Services";

/* No comment provided by engineer. */
"Subject: " = "Aihe:";

/* No comment provided by engineer. */
"Temporarily Hide From %@" = "Piilota väliaikaisesti henkilöltä: %@";

/* No comment provided by engineer. */
"The certificate of the server %@ is not trusted, which means that the server's identity cannot be automatically verified. Do you want to continue connecting?\n\nFor more information, click \"Show Certificate\"." = "The certificate of the server %@ is not trusted, which means that the server's identity cannot be automatically verified. Do you want to continue connecting?\n\nFor more information, click \"Show Certificate\".";

/* No comment provided by engineer. */
"The name you entered is not registered. Check to ensure you typed it correctly." = "The name you entered is not registered. Check to ensure you typed it correctly.";

/* No comment provided by engineer. */
"The other user is in your deny list." = "Olet torjunut toisen käyttäjän.";

/* No comment provided by engineer. */
"The other user is temporarily unavailable." = "Toinen käyttäjä ei ole tällä hetkellä tavoitettavissa.";

/* Invalid name on AIM */
"The screen name you entered is not registered. Check to ensure you typed it correctly. If it is a new name, you must register it at www.aim.com before you can use it." = "Antamasi viestinimi ei ole käytössä. Varmista, että olet kirjoittanut sen oikein. Jos sinulla ei vielä ole AIM-viestinimeä sinun tulee rekisteröidä se osoitteessa www.aim.com.";

/* Be careful to keep the % parts the same in this string. %@ will be replaced by an error message. */
"The Zephyr Host Manager reported an error #%d: %@" = "The Zephyr Host Manager reported an error #%1$d: %2$@";

/* Description for the MSN display name setting dialogue. */
"This is the name that other MSN buddies will see you as." = "MSN ystäväsi näkevät sinunt tällä nimellä.";

/* No comment provided by engineer. */
"This node does not provide any services accessible to this program." = "This node does not provide any services accessible to this program.";

/* No comment provided by engineer. */
"This node provides ad-hoc commands. Open the context menu to access them." = "This node provides ad-hoc commands. Open the context menu to access them.";

/* No comment provided by engineer. */
"This operation would remove the gateway %@ itself and all contacts belonging to the gateway on your contact list. It cannot be undone." = "This operation would remove the gateway %@ itself and all contacts belonging to the gateway on your contact list. It cannot be undone.";

/* No comment provided by engineer. */
"Transferring" = "Transferring";

/* user tune tooltip title */
"Tune" = "Tune";

/* No comment provided by engineer. */
"Un-hide From %@" = "Un-hide From %@";

/* No comment provided by engineer. */
"Unable to parse the server list at %@. Please try again later." = "Unable to parse the server list at %@. Please try again later.";

/* No comment provided by engineer. */
"United States" = "Yhdysvallat";

/* No comment provided by engineer. */
"Unsubscribe %@" = "Poista tilaus %@";

/* Sample name and server for new livejournal accounts */
"username" = "käyttäjänimi";

/* Sample name and server for new gmail accounts */
"username@gmail.com" = "käyttäjänimi@gmail.com";

/* Sample name and server for new Jabber accounts */
"username@jabber.org" = "käyttäjänimi@jabber.org";

/* No comment provided by engineer. */
"Verify Certificate" = "Varmenna sertifikaatti";

/* No comment provided by engineer. */
"View %@'s %@ web profile" = "View %1$@'s %2$@ web profile";

/* No comment provided by engineer. */
"View %@'s Webcam" = "Näytä %@'s webkamera";

/* No comment provided by engineer. */
"Voice" = "Voice";

/* No comment provided by engineer. */
"Waiting for Handshake Acknowledgement" = "Waiting for Handshake Acknowledgement";

/* No comment provided by engineer. */
"Waiting for Login Acknowledgement" = "Waiting for Login Acknowledgement";

/* No comment provided by engineer. */
"Waiting for Response" = "Waiting for Response";

/* No comment provided by engineer. */
"Warning level is too high." = "Varoitustaso on liian korkea.";

/* No comment provided by engineer. */
"WARNING! This will delete the account %@ from the Jabber server, and can not be undone.\nAre you sure you want to proceed?" = "WARNING! This will delete the account %@ from the Jabber server, and can not be undone.\nAre you sure you want to proceed?";

/* No comment provided by engineer. */
"XML Console" = "XML Konsoli";

/* No comment provided by engineer. */
"Yahoo! ID" = "Yahoo!-tunnus";

/* No comment provided by engineer. */
"You are sending messages too quickly; wait a moment and try again." = "Lähetät viestejä liian tiheään tahtiin. Odota hetki ja yritä uudelleen.";

/* No comment provided by engineer. */
"You have %u new messages." = "Sinulla on %u uutta viestiä.";

/* No comment provided by engineer. */
"You have 1 new message." = "Sinulla on 1 uusi viesti.";

/* No comment provided by engineer. */
"You have mail!\n" = "Sinulle on uusi sähköposti!";

/* No comment provided by engineer. */
"Your message to %@ did not get sent" = "Your message to %@ did not get sent";

/* No comment provided by engineer. */
"Your message was refused by the other user." = "Vastaanottaja ei ottanut viestiäsi vastaan.";

/* No comment provided by engineer. */
"Your message was too big." = "Viestisi oli liian pitkä.";

/* zhm is the Zephyr Host Manager and should not be a localized word */
"zhm Failure" = "zhm Failure";